timewalk = {
"ages": [ { "name" : "Hadean Eon", "start" :  4600, "end": 4000, "info": "The Hadean Eon is the oldest eon in geological time and has not been subdivided. The Hadean Eon is considered to have started when the Earth formed, approximately 4,600 million years ago, and spans 600 million years until the beginning of the Archean Eon. Conditions on Earth at this time were harsh, with the planet beginning as a ball of molten rock and iron undergoing continual meteorite bombardment."},
{ "name" : "Eoarchean Era", "start" :  4000, "end": 3600, "info": "The Eoarchean Era is the first and oldest era of the Archean Eon. It lasted for 400 million years, from 4,000 to 3,600 million years ago. During the Eoarchean Era, crust formation which began during the Hadean Eon continued and the intense meteorite bombardment ceased."},
{ "name" : "Paleoarchean Era", "start" :  3600, "end": 3200, "info": "The Paleoarchean Era is the second era in the Archean Eon and lasted 400 million years, from 3,600 to 3,200 million years ago. Stromatolite and bacterial fossils from Western Australia indicate that life had appeared on Earth early in the Paleoarchean Era. Some continents had formed by the Paleoarchean Era, but most of the surface of the planet was covered by ocean."},
{ "name" : "Mesoarchean Era", "start" :  3200, "end": 2800, "info": "The Mesoarchean Era is the third era of the Archean Eon and lasted for 400 million years, from 3,200 to 2,800 million years ago. During the Mesoarchean Era, development of continents continued. The oceans were more iron-rich than at present, giving rise to banded iron formations."},
{ "name" : "Neoarchean Era", "start" :  2800, "end": 2500, "info": "The Neoarchean Era is the youngest era in the Archean Eon and lasted for 300 million years, from 2,800 to 2,500 million years ago. During the Neoarchean Era, continental blocks continued to grow and world-class gold and nickel deposits in Western Australia were formed."},
{ "name" : "Paleoproterozoic Era", "start" :  2500, "end": 1600, "info": "The Paleoproterozoic Era is the oldest era of the Proterozoic Eon. It lasted 900 million years, from 2,500 to 1,600 million years ago and is the longest era in the Earthís history. During the early part of the Paleoproterozoic Era, free oxygen began to accumulate in the atmosphere. This is known as the ëGreat Oxidation Eventí. Soon after, the Earth experienced its first severe glaciation."},
{ "name" : "Mesoproterozoic Era", "start" :  1600, "end": 1000, "info": "The Mesoproterozoic Era is the second era of the Proterozoic Eon and lasted 600 million years, from 1,600 to 1,000 million years ago. The Mesoproterozoic Era saw further development of continents. Several continental blocks amalgamated near the end of the era to form the supercontinent known as Rodinia. Life was still confined to the ocean."},
{ "name" : "Tonian period", "start" :  1000, "end": 850, "info": "The Tonian Period is the first of three periods of the Neoproterozoic Era. It lasted 150 million years, from 1,000 to 850 million years ago. During the Tonian Period, the supercontinent of Rodinia included most of the Earthís continental crust. There are very few positively identified Tonian rocks in Australia."},
{ "name" : "Cryogenian Period", "start" :  850, "end": 635, "info": "The Cryogenian Period is the second of three periods in the Neoproterozoic Era. It lasted approximately 215 million years, from 850 to approximately 635 million years ago. During the Cryogenian Period the supercontinent Rodinia finally broke up and two great ice ages occurred. The oldest fossil single-celled animals are found in Cryogenian rocks."},
{ "name" : "Ediacaran Period", "start" :  635, "end": 542, "info": "The Ediacaran Period is the third and last period of the Neoproterozoic Era. It lasted approximately 93 million years, from approximately 635 to 542 million years ago. After the glaciations of the preceding Cryogenian Period, conditions were warmer. Multicellular animals appeared in the oceans in the middle of the Ediacaran Period and towards the end, the first shelled animals appeared."},
{ "name" : "Cambrian Period", "start" :  542, "end": 488.3, "info": "The Cambrian Period is the first period of the Paleozoic Era. It lasted 53.7 million years, from 542 to 488.3 million years ago. It is subdivided into four epochs. Early in the Cambrian Period, a major event dramatically changed the face of life on Earth. Known as the 'Cambrian Explosion' it marked a huge increase in animal diversity."},
{ "name" : "Ordovician Period", "start" :  488.3, "end": 443.7, "info": "The Ordovician Period is the second period of the Paleozoic Era. It lasted 44.6 million years, from 488.3 to 443.7 million years ago. It is subdivided into three epochs. The extinction at the end of the Cambrian Period was followed by the ëOrdovician Radiationí, early in the period. This ëradiationí was an increase in the diversity of many marine animals and plants. In addition, the first moss-like land plants colonised the shores of lakes and rivers."},
{ "name" : "Silurian Period", "start" :  443.7, "end": 416, "info": "The Silurian Period is the third and shortest period of the Paleozoic Era. It lasted 27.7 million years, from 443.7 to 416 million years ago. It is subdivided into four epochs. The Silurian Period saw the first animals invade the land in the form of small millipedes and centipedes. One metre tall vascular plants evolved and began to spread across the Earth's surface."},
{ "name" : "Devonian Period", "start" :  416, "end": 359.2, "info": "The Devonian Period is the fourth period of the Paleozoic Era. It lasted 56.8 million years, from 416 to 359.2 million years ago. It is subdivided into three epochs. The Devonian Period was marked by the appearance of many new animals, some of which are still present today, including sharks, amphibians and insects. On land, trees reached up to 30 metres in height and formed the first forests."},
{ "name" : "Carboniferous Period", "start" :  359.2, "end": 299, "info": "The Carboniferous Period is the fifth period of the Paleozoic Era. It lasted 60.2 million years, from 359.2 to 299 million years ago. It is subdivided into two epochs. This period saw the first amniotic egg which allowed the ancestors of birds, mammals and reptiles to lay their eggs safely out of water. During the Carboniferous Period, the supercontinent Gondwana merged with other continents to form the new supercontinent Pangaea."},
{ "name" : "Permian Period", "start" :  299, "end": 251, "info": "The Permian Period is the sixth and final period of the Paleozoic Era. It lasted 48 million year, from 299 to 251 million years ago. It is subdivided into three epochs. The end of the Permian Period saw the 3rd of the Earthís Big 5 mass extinctions in the Earthís history, where 95% of all species were wiped out. This event is known as the greatest biotic crisis of life on Earth, and fundamentally changed Earthís ecosystems."},
{ "name" : "Triassic Period", "start" :  251, "end": 199.6, "info": "The Triassic Period is the first period in the Mesozoic Era. It lasted 51.4 million years, from 251 to 199.6 million years ago. It is subdivided into three epochs. The Mesozoic Era is often referred to as the age of reptiles, and it was during the Triassic Period when the dinosaurs, plesiosaurs, ichthyosaurs, phytosaurs, crocodiles, turtles and mammals first evolved. By the end of the Triassic Period, rifting had started in Pangaea."},
{ "name" : "Jurassic Period", "start" :  199.6, "end": 145.5, "info": "The Jurassic Period is the second period of the Mesozoic Era. It lasted 54.1 million years, from 199.6 to 145.5 million years ago. It is subdivided into three epochs. Dinosaurs roamed the land, including some of the largest animals to walk the Earth. The oceans were full of fish, squid and reptiles, while the sky was filled with pterosaurs and later, birds."},
{ "name" : "Cretaceous Period", "start" :  145.5, "end": 65.5, "info": "The Cretaceous Period is the third period of the Mesozoic Era. It lasted 80 million years, from 145.5 to 65.5 million years ago. It is subdivided into two epochs. Dinosaurs initially dominated the landscape but populations began to decline, and at the end of this period, the remaining dinosaurs and several other major animal groups became extinct during the Cretaceous-Paleogene extinction event, the 5th and last of the Earthís Big 5 mass extinctions. Gondwana began to break up during the Early Cretaceous Period."},
{ "name" : "Paleogene Period", "start" :  65.5, "end": 23, "info": "The Paleogene Period is the first of the three periods of the Cenozoic Era and lasted about 42.5 million years, from 65.5 to 23 million years ago. It is subdivided into three epochs. The extraordinary diversification of mammals characterises the Paleogene Period. There was also a short-lived dramatic rise of some 6∫C in the Earthís average temperature during the Paleocene-Eocene Thermal Maximum. This was accompanied by an extinction event."},
{ "name" : "Neogene Period", "start" :  23, "end": 2.5, "info": "The Neogene Period is the second period in the Cenozoic Era, which lasted for 20.5 million years, from 23 to 2.5 million years ago. It is subdivided into two epochs. During the Neogene Period, landscapes as we know them today began to take shape. The first hominids appeared."},
{ "name" : "Quaternary Period", "start" :  2.5, "end": 0, "info": "The Quaternary Period began 2.588 million years ago and continues to the present day. The Quaternary Period is subdivided into two epochs. This period represents the world as we know it today. Although the Quaternary Period saw the continents reach their current positions, they still continue to drift slowly. In the Quaternary Period, hominids left Africa and colonised most continents on Earth."}
]
}